<html>
<head>
<title>Deutsch - Anzeige</title>
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<h1>Anzeige</h1><br>
<br>
<br>
<br>
Am rechten Rand des Spielfeldes ist ein schmale Leiste auf der w&auml;hrend des Spiels der Status ihres Schiffes angezeigt wird. Diese Anzeigeleiste ist in 2 H&auml;lften unterteilt. Die obere "geh&ouml;rt" Spieler 1 und die untere Spieler 2. Unterhalb des Textes Player 1/2 sieht man ein Bild des ausgew&auml;hlten Schiffes. Danach kommt ein kurzer Text, der den momentanen Feuermodus angibt. Hierbei steht "auto" f&uuml;r automatisch, "man." f&uuml;r manuel und "alt." f&uuml;r alternativ. Beim Feuermodus auto zielt man immer auf seinen Gegner, es sei denn er ist nicht sichtbar, dann wird einfach nach vorne oder nach hinten gefeuert. Bei manuel erfasst er nie ein Ziel sonder schie&szlig;t immer in Flugrichtung(au&szlig;er bei Hecktorpedos). Der Feuermodus alternativ zielt prim&auml;r auf andere Ziele als den Gegner. Man nimmt ihn um den zus&auml;tzlichen Computergegner oder Spezialwaffen des Feindes abzuschie&szlig;en. Wenn keine dergleichen Objekte mehr vorhanden sind, dann wird erst auf den Gegner gezielt. Noch etwas allgemeines zu den Waffen. Die Laser zielen je nach Feuermodus auf die entsprechenden Objekte. Die Torpedos zielen entweder nach vorn oder nach hinten je nachdem wo sich der Gegner eher befindet, sind keine Torpedos in der jeweiligen Richtung mehr gelanden, dann wir einfach in die Gegenrichtung gefeuert. Die Spezialwaffen sind vom Feuermodus unabh&auml;ngig. Der rote Balken direkt unter der Feuermodusanzeige gibt die St&auml;rke der Panzerung an. Je l&auml;nger der Balken ist umso mehr hat man davon und sobald dieser Balken Null erreicht hat explodiert man und man hat verloren. Gleich danebe ist eine gelbe Leiste welche die momentan zur Verf&uuml;gung stehenden Spezialwaffenenergie angiebt. Diese Energie l&auml;dt sich langsam selbst auf. Bei jeder Benutzung der Spezialwaffe verringert sie sich. Neben diesen Balken befindet sich eine reihe von kleinen Kreisen, welche die momentane Ladung der torpedos angibt. Man kann Torpedos nur bei voller Ladung abfeuern. Wird ein Torpedo geladen ist der entsprechende Kreis rot. Das rot wird immer kr&auml;ftiger je besser er geladen ist. Sobald der Torpedo voll geladen ist &auml;ndert sich die Farbe des Kreises auf gr&uuml;n. Hellgr&uuml;n stellt die Bugtorpedos da, w&auml;hrend dunkelgr&uuml;n die Hecktorpedos repr&auml;sentiert. Das gleiche gilt auch f&uuml;r die Laser, dessen Ladekreise sich gleich daneben befinden. Es gibt nur einen Unterschied. Voll aufgeladene Laser sind blau und da dies Waffe 360° feuern kann gibt es keien Abstufungen f&uuml;r Heck oder Bug. Noch eine weitere Anzeige befindet sich in der Leiste. Oberhalb der Ladeanzeige f&uuml;r die Waffen befindet sich eine Zahl. Sie gibt an wieviele Punkte der jeweilige Spieler hat.        <br>
<br>
<br>

</body>
</html>