<html>
<head>
<title>Deutsch - Bedienung</title>
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<h1>Bedienung</h1><br>
<br>
<br>
Nach dem Start des Programmes kommen sie sofort ins Hauptmen&uuml;. Die Sprache dort und im ganzen Spiel ist wie ihnen sicher sofort auffallen wird Englisch. Dies sollte aber, auch wenn sie die Sprache nicht beherschen, dank der Gebrauchsanweisung kein allzu gro&szlig;es Hindernis sein. Um &uuml;berhaupt einmal das Spiel starten zu k&ouml;nnen m&uuml;ssen sie ein Schiff ausw&auml;hlen. F&uuml;r Spieler 1 nehmen sie die linke Maustaste und klicken sie auf das entsprechende Bild. Es bkommt dann einen gelben Rahmen. Spieler 2 w&auml;hlt es mit der rechten Maustaste aus und dass Schiff bekommt dann einen t&uuml;rkisen Rahmen. Sie k&ouml;nnen auch beide das selbe Schiff ausw&auml;hlen. Sollte sie mit der "Computerplayer off/Computerplayer on"-Taste einen Computergegner eingesschaltet haben so sind sie automatisch Spieler 1 und der Computer w&auml;hlt sein Schiff selbst aus. Noch etwas zu dieser Taste. Zeigt sie "Computerplayer on" an so spielen sie gegen den Computer, sonst nicht. Sie &auml;ndern den Status indem sie einfach darauf klicken. Um nach der Auswahl der Schiffe das Spiel zu starten, klicken sie auf "start game" und los geht's! Um w&auml;rend des Spiels abzubrechen m&uuml;ssen sie nur die Esc-Taste dr&uuml;cken und um zu pausieren die Pause-Taste. Wenn sie den Punktestand beider Spieler auf Null setzen wollen, dann m&uuml;ssen sie auf "reset score" klicken. F&uuml;r eine &Auml;nderung der Tastaturbelegung ist "edit keys" zust&auml;ndig und f&uuml;r die Ingame-Hilfe m&uuml;ssen sie den Knopf "HELP" dr&uuml;cken. Wenn sie das Programm beenden wollen, dann klicken sie auf "quit game". Auf der rechten Seite des Hauptmen&uuml;s befinden sich noch einige Tasten um das Spiel zu editieren. Im Mapeditor k&ouml;nnen sie sich selbst eine Karte f&uuml;rs Spiel gestallten. Mit den anderen Tasten steuern sie einige Kartenobjekte und Spieleigenschaften: "wormhole on/off" = Wurnloch ein/aus, "events on/off" = Ereignisse ein/aus (Supernova, weitere Computerfeind und Asteroidenhagel), "sun on/off" = Sonne ein/aus, "nebula on/off" = Nebel ein/aus, "astroids on/off" = Asteroiden ein/aus, "black hole on/off" = Schwarzes Loch ein/aus, "anomalie on/off" = Anomalie ein/aus und "spezials on/off" = Spezialwaffen ein /aus. <br>
<br>
<br>



</body>
</html>