<html>
<head>
<title>Deutsch - Kartenobjekte</title>
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<h1>Kartenobjekte</h1><br>
<br>
<br>
<br>
Um das Spiel interessanter zu machen, gibt es bei Starfight viele Kartenobjekte, die sie nach Belieben hinzu und weg schalten k&ouml;nnen. <br>
<br>
<br><div align="center">
<table  border=2 bordercolor=#00A000 width=70%>
<tr>
 <td> <b>Objekt</b></td>
 <td> <b>Eigenschaften</b></td>
 <td> <b>Effekte</b></td>
</tr>
<tr>
 <td>Sonne </td>
 <td>starkes Gravitationsfeld, hohe Reibung, besch&auml;digt Schiffe schwer </td>
 <td>Supernova </td>
</tr>
<tr>
 <td>Asteroiden </td>
 <td>fixe bzw. bewegliche Felsbrocken, Schaden bei Kollision </td>
 <td>Asteroidenhagel </td>
</tr>
<tr>
 <td>Anomalie </td>
 <td>variables Gravitationsfeld, leichte bis mittlere Sch&auml;den bei Zusammensto&szlig; </td>
 <td>keine </td>
</tr>
<tr>
 <td>Schwarzes Loch </td>
 <td>unsichtbar(nur Hintergrundsterne bewegen sich), Gravitationsfeld </td>
 <td>keine </td>
</tr>
<tr>
 <td>Nebel </td>
 <td>Schiffe werden unsichtbar </td>
 <td>Nebelexplosion(kann man nicht mit "events off" abstellen!) </td>
</tr>
<tr>
 <td>Wurmloch </td>
 <td>Gravitation bei &Ouml;ffnung, wird nur sichtbar wenn ein Schiff in der N&auml;he ist, transportier Schiff zu anderem Ort, ver&auml;ndert Position </td>
 <td>keine </td>
</tr>
</table></div><br>
<br>
<br>
<h2>Ereignisse</h2><br>
<br>
<h3>Computergegner</h3>
Feindliches Schiff mit Spezialwaffen und Torpedos taucht auf. Greif immer n&auml;chstes Schiff an und verfolgt es! Wahrscheinlichkeit pro Programmdurchlauf 1:1000.
<br>
<br>
<h3>Supernova</h3>
Die Sonne explodiert wenn sie von bestimmten starken Waffen getroffen wird. Diese Explosion breitet sich langsam aus bis sie das ganze Spielfeld bedeckt. Alles was von ihr erreicht wird, wird zerst&ouml;rt. Ausl&ouml;ser: Subraumtorpedo, Energied&auml;mpfungswaffe oder Schockwelle. Weiters kann sie auch ohne Grund passieren mit einer Wahrscheinlichkeit pro Programmdurchlauf von 1: 100000.<br>
<br>
<h3>Asteroidenhagel</h3>
Es kann geschehen das bewegliche Asteroiden in das Spielfeld kommen. Sie sind etwas gr&ouml;&szlig;er als normale Asteroiden und werden von der Gravitation anzogen. Sie von Sonne oder Anomalie zerst&ouml;rt werden und prallen von anderen Asteroiden ab. Wahrscheinlichkeit pro Programmdurchlauf 1:1000.
<br>
<br>
<h3>Nebelexplosion</h3>
Ein Nebel besteht aus unz&auml;hligen Gas und Staubteilchen, welche sich bei einer entsprechenden Startenergie entz&uuml;nden k&ouml;nnen. Diese Ereignis wird ausgel&ouml;st wenn der Nebel von der Supernova erreicht wird, wenn eine Lenkrakte im Nebel explodiert oder wenn ein Subraumspalt den Nebel ber&uuml;hrt. Solange der Nebel brennt werden alle Schiffe die in ihn hineinfliegen besch&auml;digt. Nach der Explosion baut er sich langsam Selbstst&auml;ndig wieder auf.     <br>
<br>

</body>
</html>